class Site:
    main_site = 'https://qa-scooter.praktikum-services.ru/'
    dzen_site = 'https://dzen.ru/?yredirect=true'


class AnswersText:
    text_answer_1 = 'Сутки — 400 рублей. Оплата курьеру — наличными или картой.'
    text_answer_2 = 'Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.'
    text_answer_3 = 'Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.'
    text_answer_4 = 'Только начиная с завтрашнего дня. Но скоро станем расторопнее.'
    text_answer_5 = 'Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.'
    text_answer_6 = 'Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.'
    text_answer_7 = 'Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.'
    text_answer_8 = 'Да, обязательно. Всем самокатов! И Москве, и Московской области.'

class SiteOrderDaniil:
    name = 'Даниил'
    surname = 'Гордиенко'
    address = 'Ул. Пушкина д. Колотушкина'
    phone = '+79688888888'
    comment = 'Соизвольте предоставить самокат'


class SiteOrderElse:
    name = 'Фома'
    surname = 'Киняев'
    address = 'Москва СССР'
    phone = '89688888888'
    comment = 'Проект «Тредстоун» необходимо закрыть'
